provinces_list = [
"Аньхой",
"Ганьсу",
"Цзилинь",
"Гуандун",
"Гуйчжоу",
"Ляонин",
"Сычуань",
"Юньнань",
"Фуцзянь",
"Хайнань",
"Хубэй",
"Хунань",
"Хэбэй",
"Хэйлунцзян",
"Хэнань",
"Цзянси",
"Цзянсу",
"Цинхай",
"Чжэцзян",
"Шаньдун",
"Шаньси",
"Тайвань",
]

provinces_facts = { 
                    'Аньхой':
                        {
                        'name_province' : 'Аньхой',
                        'translate_name': '安徽',
                        'translate_name_province' : '安徽, Пиньин: Ānhuī.',
                        'province_facts' : 'Хэфэй — столица провинции Аньхой. Большая часть провинции Аньхой находится в горах. Главное сокровище провинции Аньхой — Хуаншань, Желтые горы.\n\n'
              'В Аньхое выращивают сразу несколько всемирно известных сортов. Зелёные Хуаншань Маофэн, Тайпин Хоукуй, Люань Гуапянь. Красный чай (у нас его называют черным) Кимун из уезда Цимэнь.\n'
              'Аньхой считается родиной сыра тофу, он же соевый творог. Здесь его начали делать еще 2 тысячи лет назад.'},
                    'Ганьсу':
                        {
                        'name_province' : 'Ганьсу',
                        'translate_name' : '甘肃',
                        'translate_name_province' : '甘肃, Пиньин: Gānsù.',
                        'province_facts' : 'Административный центр и крупнейший город — Ланьчжоу. Согласно переписи 2020 года в Ганьсу проживало 25,019 млн человек.\n\n'
                        'Ганьсу — один из самых сейсмоопасных регионов Китая. 16 декабря 1920 году здесь произошло крупное землетрясение, в результате которого погибло до 200 тыс. человек. В 2010 году в Ганьсу произошел оползень, вызвавший человеческие жертвы.\n\n'
                        'Провинция является одним из наиболее мультикультурных регионов Китая. Здесь сильно влияние ислама (хуэй и другие исповедующие ислам народности Китая), тибетского буддизма, ханьской культуры.'},
                    'Цзилинь':
                        { 
                        'name_province' : 'Цзилинь',
                        'translate_name' : '吉林',
                        'translate_name_province' : '吉林, Пиньин: Jílín.',
                        'province_facts' : 'Также назвыватеся Гирин. Административный центр и крупнейший город — Чанчунь. Согласно переписи 2020 года в Гирине проживало 24,073 млн человек\n\n'
                        'Население провинции почти не растет примерно с 2000 года. Провинция отличается низкими показателями рождаемости (7,91 человек на 1 тысячу жителей, что почти в 1,5 раза ниже общекитайского показателя) и естественного прироста (2,03 человека на 1 тыс. жителей в 2010 году, что более, чем в два раза ниже общекитайского показателя)\n\n'
                        'Лечение в Цзилине популярно из-за санаториев, расположившихся на плоскогорье Чанбайшань. Условия заповедника и находящихся там лечебниц позволяют не только вернуть утраченное здоровье, но и поднять жизненный тонус, расслабиться и хорошо отдохнуть.'},
                    'Гуандун':
                        {
                        'name_province' : 'Гуандун',
                        'translate_name': '广东',
                        'translate_name_province' : '广东, Пиньин: Guǎngdōng.',
                        'province_facts' : 'Административный центр провинции — город Гуанчжоу. История, культура и язык (диалект) провинции Гуандун довольно сильно отличаются от других районов страны (Кантонский диалект). За последние годы Гуандун стал одной из наиболее экономически развитых провинций Китая.\n\n'
                        'Согласно переписи 2020 года в Гуандуне проживало 126,012 млн человек.\n\n'
                        'Гуандун считается самой богатой провинцией Китая. ВВП провинции Гуандун примерно равен ВВП России. Провинция являться родиной восточного единоборства - Ушу.'},
                    'Гуйчжоу':
                        {
                        'name_province' : 'Гуйчжоу',
                        'translate_name': '贵州',
                        'translate_name_province' : '贵州, Пиньин: Guìzhōu.',
                        'province_facts' : 'Согласно переписи 2020 года в Гуйчжоу проживало 38,562 млн человек.\n\n'
                        'Важное значение в экономике Гуйчжоу играет цифровая экономика: провинция является крупнейшим центром больших данных и облачных вычислений Китая, здесь получили значительное развитие сети 5G и производство программного обеспечения.\n\n'
                        'Провинция славится национальными праздниками (по статистике ежегодно отмечается более 1000 праздников — самым крупным считается Новый год, который выпадает на разное время в промежутке между сентябрем и декабрем, его отмечают почти две недели; ежегодный бой буйволов и пр).'},
                    'Ляонин':
                        {
                        'name_province' : 'Ляонин',
                        'translate_name': '辽宁',
                        'translate_name_province' : '辽宁, Пиньин: Liáoníng.',
                        'province_facts' : 'Административный центр и крупнейший город — Шэньян. Согласно переписи 2020 года в Ляонине проживало 42,591 млн человек\n\n'
                        'В провинции Ляонин базируются крупные компании из списков Fortune Global 500 и Forbes Global 2000, в том числе Ansteel Group и China Zhongwang Holdings (металлургия), Hengli Petrochemical (нефтехимия), Bank of Jinzhou и Shengjing Bank (финансовые услуги).\n\n'
                        'Рядом с городом Аньшань находятся нефритовые месторождения.'},
                    'Сычуань':
                        {
                        'name_province' : 'Сычуань',
                        'translate_name': '四川',
                        'translate_name_province' : '四川, Пиньин: Sìchuān.',
                        'province_facts' : 'Столица и крупнейший город — Чэнду. Согласно переписи 2020 года в Сычуани проживало 83,674 млн человек.\n\n'
                        'Провинция делится на 21 административно-территориальную единицу: 17 городских округов, 1 город субпровинциального значения и 3 автономных округа.\n\n'
                        'Основной достопримечательностью экологического туризма является заповедник и питомник панд и Институт панды в окрестностях Чэнду.'},
                    'Юньнань':
                        {
                        'name_province' : 'Юньнань',
                        'translate_name': '云南',
                        'translate_name_province' : '云南, Пиньин: Yúnnán.',
                        'province_facts' : 'Административный центр и крупнейший город — Куньмин. Согласно переписи 2020 года, в Юньнани проживало 47,209 млн человек\n\n'
                        'Большую часть территории провинции покрывают горы. На севере предгорья Тибета, в частности, хребет Хэндуань, достигают в высоту 6740 м. К югу горы переходят в живописные холмы и долины с плодородными почвами.\n\n'
                        '50 % всех случаев заражения малярией в КНР приходятся на провинцию Юньнань. Юньнань — район, эндемичный по чуме; некоторые авторы даже полагают, что третья пандемия чумы началась именно в провинции Юньнань[19]. Спорадические случаи заболевания чумой происходят и в настоящее время'},
                    'Фуцзянь':
                        {
                        'name_province' : 'Фуцзянь',
                        'translate_name': '福建',
                        'translate_name_province' : '福建, Пиньин: Fújiàn.',
                        'province_facts' : 'Власти провинции размещаются в Фучжоу. Согласно переписи 2020 года в Фуцзяни проживало 41,54 млн человек\n\n'
                        'Важное значение имеет переработка бамбука, под которым в провинции Фуцзянь занято более 1 млн гектаров плантаций. Бамбук используется для производства свежих и консервированных съедобных побегов, пиломатериалов, напольных покрытий, мебели, лигнина, активированного угля, строительных касок и шляп; бамбуковые опилки сжигают на электростанциях в качестве биомассы.\n\n'
                        'В провинции наодятся знаменитые Фуцзянь Тулоу - это комплекс из 46 глинобитных зданий, построенных между 15 и 20 веками на протяжении 120 км к юго-западу от провинции Фуцзянь, вглубь материка от Тайваньского пролива. Эти здания являются исключительным свидетельством давней культурной традиции оборонительных сооружений, которые использовались не только для общинного проживания, но и для обороны, отражая сложные строительные традиции и идеи гармонии и сотрудничества.'},
                    'Хайнань':
                        {
                        'name_province' : 'Хайнань',
                        'translate_name': '海南',
                        'translate_name_province' : '海南, Пиньин: Hǎinán.',
                        'province_facts' : 'Административный центр и крупнейший город — Хайкоу.\n\n'
                        'Провинция - это остров, где есть плантации манго, бананов, ананасов, кофе, чая, кокосов и сахарного тростника.\n\n'
                        'На острове существует сеть подземных военных комплексов, точное месторасположение и назначение которых засекречено\n\n'},
                    'Хубэй':
                        {
                        'name_province' : 'Хубэй',
                        'translate_name': '湖北',
                        'translate_name_province' : '湖北, Пиньин: Húběi.',
                        'province_facts' : 'Органы власти провинции размещаются в Ухане. Согласно переписи 2020 года в Хубэе проживало 57,752 млн человек\n\n'
                        'Важное значение имеют грузовые железнодорожные перевозки из Уханя в Европу. Компании провинции экспортируют автозапчасти, электронику, бытовые и медицинские товары\n\n'
                        'Хубэй называют "провинцией тысячи озер", по данным на 1985 год в провинции более 1300 озер, примерно 300 водоемов имеют площадь водного зеркала в 3 кв. км. Большинство из них сконцентрировано на равнине Цзянхай. Река Янцзы протекает с запада на восток, длина ее русла на территории провинции 1061 км. Ее крупнейший приток-река Хайцзян, течет с северо-запада на юго-восток, и в Ухани впадает в Янцзы.'},
                    'Хунань':
                        {
                        'name_province' : 'Хунань',
                        'translate_name': '湖南',
                        'translate_name_province' : '湖南, Пиньин: Húnán.',
                        'province_facts' : 'Административный центр и крупнейший город — Чанша. Согласно переписи 2020 года в Хунани проживало 66,444 млн человек.\n\n'
                        'В Хунани преобладают буддизм, даосизм, конфуцианство, китайская народная религия и культ предков, которые тесно переплетены между собой[24]. Гора Хэншань является местом паломничества даосистов и буддистов со всего Китая. Около 0,8 % населения считают себя христианами. Католики принадлежат к архиепархии Чанши, епархии Чандэ и епархии Хэнчжоу. Также имеются последователи протестантизма (главным образом Церкви истинного Иисуса и Епископальной церкви) и ислама. Среди мяо, яо и дун распространены анимизм и шаманизм.\n\n'
                        'Хунань входит в тройку наиболее популярных туристических направлений Китая. Во время новогодних (январь—февраль), майских и октябрьских праздников десятки миллионов китайцев посещают природные и исторические достопримечательности провинции, прибывая в Хунань на поездах, автобусах, самолётах и личных автомобилях.'},
                    'Хэбэй':
                        {
                        'name_province' : 'Хэбэй',
                        'translate_name': '河北',
                        'translate_name_province' : '河北, Пиньин: Héběi.',
                        'province_facts' : 'Административным центром является Шицзячжуан. Согласно переписи 2020 года в Хэбэе проживало 74,61 млн человек.\n\n'
                        'Провинция Хэбэй является крупнейшим производителем стали и чугуна в Китае.\n\n'
                        'Хэбэй — самая загрязненная провинция в стране. По данным министерства защиты окружающей среды Китая, в первом полугодии 2018 года пять из 10 самых загрязненных городов страны находились именно в Хэбэе, в том числе административный центр — Шицзячжуан. Сложная экологическая ситуация связана с деятельностью металлургических заводов Хэбэя, облака смога от которых доходят даже до Пекина'},
                    'Хэйлунцзян':
                        {
                        'name_province' : 'Хэйлунцзян',
                        'translate_name': '黑龙江',
                        'translate_name_province' : '黑龙江, Пиньин: Hēilóngjiāng.',
                        'province_facts' : 'Административный центр и крупнейший город — Харбин. Другие крупные города — Цицикар, Суйхуа, Дацин и Муданьцзян. Согласно переписи 2020 года в Хэйлунцзяне проживало 31,85 млн человек\n\n'
                        'В провинции Хэйлунцзян действует 171 природный заповедник, в том числе 8 — в бассейне реки Уссури, формируя так называемую «зелёную полосу».\n\n'
                        'Основное значение имеет экотуризм. Река Сунгари и водно-болотные угодья являются главными достопримечательностями, их посещают 6,1 млн человек (2011). Из фестивалей значимы Харбинский фестиваль ледяной скульптуры, Фестиваль пива, Харбинская ярмарка, летний концерт в Харбине и путешествия по горам Ухуа. На территории провинции находится один из объектов экотуризма — геологический парк мирового значения. Частью парка является природная зона государственного значения «Первобытный кратерный лес», расположенная в 50 км от озера Цзинбоху. Ежегодно в регион приезжают более 1 млн туристов из России.'},
                    'Хэнань':
                        {
                        'name_province' : 'Хэнань',
                        'translate_name': '河南',
                        'translate_name_province' : '河南, Пиньин: Hénán.',
                        'province_facts' : 'Административный центр и крупнейший город — Чжэнчжоу. Согласно переписи 2020 года в Хэнани проживало 99,365 млн человек.\n\n'
                        'Хэнань — одна из колыбелей китайской культуры. На территории провинции имеются важнейшие археологические памятники: древние городища Пэйлиган (возраст — 7000 лет назад), Яншао (6000 лет) и Дахэ (5000 лет). На протяжении многотысячелетней истории китайской цивилизации более 20 империй устанавливали или переносили столицы своих государств в Хэнань.\n\n'
                        'Здесь находятся монастырь Шаолинь и пещерные храмы Лунмэн. Около Лояна находится древнейший буддийский храм Китая — Баймасы (Храм Белой лошади). Другим древним храмом является монастырь Фавансы, находящийся вблизи Дэнфэна. Хэнаньская опера является одним из традиционных жанров китайского театра.'},
                    'Цзянси':
                        {
                        'name_province' : 'Цзянси',
                        'translate_name': '江西',
                        'translate_name_province' : '江西, Пиньин: Jiāngxī.',
                        'province_facts' : 'Власти провинции размещаются в Наньчане. Согласно переписи 2020 года в Цзянси проживало 45,188 млн человек.\n\n'
                        'Самая известная гора провинции — Саньциншань, находящаяся в одноименном национальном парке, вместе с горами Лушань включенная в список Всемирного наследия ЮНЕСКО. На склонах горы разбросаны группы гранитных скал, напоминающие людей и животных.\n\n'
                        'Город Жуйцзинь в южной части Цзянси китайцы называют «Первой красной столицей»: в 1931-1934 гг. он был центром Китайской Советской республики, созданной под руководством Коммунистической партии Китая, и резиденцией Центрального рабоче-крестьянского демократического правительства.'},
                    'Цзянсу':
                        {
                        'name_province' : 'Цзянсу',
                        'translate_name': '江苏',
                        'translate_name_province' : '江苏, Пиньин: Jiāngsū.',
                        'province_facts' : ' Административный центр провинции, город Нанкин (Наньцзин), несколько раз на протяжении истории становился столицей Китая. Согласно переписи 2020 года в Цзянсу проживало 84,748 млн человек\n\n'
                        'Цзянсу — одна из наиболее развитых в экономическом плане провинций Китая, она имеет второй по величине ВВП после Гуандуна. В 2003 г. ВВП на душу населения составлял 16 796 юаней (около 2 тыс. долларов США). Среди отдельных регионов провинции наблюдается большое неравенство — так, в южных городах Сучжоу и Уси этот показатель в два раза выше среднего уровня.\n\n'
                        'Цзянсу располагает тремя объектами Всемирного культурного наследия и (по неповторимой китайской терминологии) 5 «национальными живописными районами», 19 национальными «историческими и культурными» городами Китая, 6 «историческими и культурными» городами провинциального значения, 122 «ключевыми национальными реликвиями», среди которых Великий Китайский канал, 645 памятниками истории и культуры провинциального значения. Добраться до самых удаленных из этих мест не составляет никаких проблем: в провинции отличная дорожная сеть.'},
                    'Цинхай':
                        {
                        'name_province' : 'Цинхай',
                        'translate_name': '青海',
                        'translate_name_province' : '青海, Пиньин: Qīnghǎi.',
                        'province_facts' : 'Административный центр и крупнейший город — Синин. Согласно переписи 2020 года в Цинхае проживало 5,923 млн человек.\n\n'
                        'Цайдамская котловина является крупным центром выращивания ягод годжи.\n\n'
                        'Цинхай — самое крупное соленое озеро Китая. Оно находится в одноименной провинции, примерно в 150 км от ее административного центра — города Синин. Это озеро часто называют морем, но не только из-за внушительных размеров водоема.'},
                    'Чжэцзян':
                        {
                        'name_province' : 'Чжэцзян',
                        'translate_name': '浙江',
                        'translate_name_province' : '浙江, Пиньин: Zhèjiāng.',
                        'province_facts' : 'Власти провинции размещаются в Ханчжоу. Согласно переписи 2020 года в Чжэцзяне проживало 64,567 млн человек\n\n'
                        'Несколько морских портов провинции входят в число крупнейших портов мира, в том числе Нинбо, Чжоушань и Цзясин.\n\n'
                        'Важное значение имеют грузовые железнодорожные перевозки по маршруту Чжэцзян — Европа и Чжэцзян — Центральная Азия. Главным железнодорожным узлом является уезд Иу.'},
                    'Шаньдун':
                        {
                        'name_province' : 'Шаньдун',
                        'translate_name': '山东',
                        'translate_name_province' : '山东, Пиньин: Shāndōng.',
                        'province_facts' : 'Административный центр — город Цзинань. Согласно переписи 2020 года в Шаньдуне проживало 101,527 млн человек (по численности населения провинция занимает второе место в Китае, после Гуандуна).\n\n'
                        'Шаньдун выгодно расположен на пересечении множества торговых путей, до относительно недавнего времени, в основном, водных. Река Хуанхэ связывает побережье с внутренними районами Китая по направлению запад-восток, а Великий Канал с древних времен служит путем сообщения между северными и южными районами страны; Шаньдунский полуостров же находится недалеко от Корейского полуострова и Японского архипелага.'},
                    'Шаньси':
                        {
                        'name_province' : 'Шаньси',
                        'translate_name': '山西',
                        'translate_name_province' : '山西, Пиньин: Shānxī.',
                        'province_facts' : 'Административный центр и крупнейший город — Тайюань. Согласно переписи 2020 года в Шаньси проживало 34,915 млн человек.\n\n'
                        'На севере примыкает к Внутренней Монголии. На востоке граничит с Хэбэй, а на западе с Шэньси.\n\n'
                        'Жители провинции Шаньси говорят на особом диалекте китайского языка, который некоторые лингвисты даже выделяют в отдельный язык. Название - Цзинь, или шаньсийский.'},
                    'Тайвань':
                        {
                        'name_province' : 'Тайвань',
                        'translate_name': '台湾',
                        'translate_name_province' : '台湾, Пиньин: Táiwān.',
                        'province_facts' : 'В международном контексте именует себя либо Кита́йская Респу́блика (Тайва́нь)[10], либо просто Тайва́нь[10] (по названию острова, составляющего бо́льшую часть контролируемой республикой территории) — частично признанное государство в Восточной Азии, ранее имевшее однопартийную систему, широкое дипломатическое признание и контроль над всем Китаем. Являлась одним из основателей ООН и постоянным членом её Совета Безопасности.\n\n'
                        'Известные тайваньские блюда — тайваньский суп с лапшой из говядины, гуа бао, цзунцзы, тайваньская жареная курица, вермишель, санбэйцзи и желе айю. Путеводитель Мишлен начал обзор ресторанов в Тайбэе в 2018 году, а в Тайчжуне в 2020 году. В 2014 году газета The Guardian назвала тайваньские ночные рынки «лучшими рынками уличной еды в мире». Чай с шариками, созданный на Тайване, стал глобальным явлением.\n\n'
                        'В 2017 году Китайская Республика легализовала однополые браки и, таким образом, стала первым государством в Азии, разрешившим регистрировать однополые браки.'} 
}