[
"Официальное название китайского языка — 中国话（zhōngguóhuà). Также называют его 汉语(hànyǔ или речь ханцев).",
"В Китае бесчисленное количество диалектов. Но в последнее время наибольшее распространение (благодаря радио и телевидению) получил пекинский 普通话(pǔtōnghuà).",
"Китайский язык — язык тональный, одна и та же гласная может произноситься пятью разными способами (без тона, ровный, восходящий, нисходяще-восходящий, нисходящий) — а, ā,á,ǎ, à",
"Абсолютно все иероглифы состоят из ключей (радикалов). Как пример — 好 (hǎo — хорошо) — состоит из 女 (nǚ — женщина) и 子(zi — ребенок). Как объясняют это преподаватели — женщина и ребенок — всегда хорошо.",
"Грамотность в Китае всегда была уделом знати. Для изучения традиционных иероглифов необходимо было затратить десяток лет жизни, чего крестьянин себе позволить никак не мог.",
"В китайском языке нет иероглифа, который читается более, чем в один слог.",
"Для каждого члена семьи имеется отдельное слово: для старшего и младшего брата, для старшей и младшей сестры, для дедушки и бабушки.",
"Не существует китайских клавиатур. Все они вводятся пиньином — вы набираете латиницу и циферкой выбираете нужный иероглиф.",
"В Китае самое большое количество городов-миллионников на планете — более двадцати.",
"Исследования показали, что люди, говорящие на китайском, используют обе височные доли своего мозга. А вот англоговорящие используют только левую сторону. Это как раз связано с тональностями.",
"Китайская письменность имеет очень странную, непонятную для иностранца, логику. Лингвисты советуют изучать язык наравне с культурой страны, так как они практически неразделимы с древних времен.",
"Китайский имеет невероятно простую грамматику. В нем нет даже родов и множественных чисел, нет спряжений глаголов. Он мог бы быть самым простым языком в мире, если бы не огромное количество иероглифов и разделения по тонам.",
"Китайская молодежь в интернет-общении использует цифровые коды. С помощью набора цифр была разработана специальная система общения с часто используемыми фразами. Например, 520 - 'я тебя люблю', а 065 - 'извини меня'.",
"С русским у китайского языка есть пара общих слов. К ним относится 'чай' (chá), 'мама' (māma) и 'папа' (bàba).",
"В полном китайском алфавите содержится около 40.000 иероглифов.",
"В это трудно поверить, но даже в современном КНР заимствованных слов всего около 1000.",
"В китайском языке отсутствует пунктуация"
    ]